rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_QUADSPI.h
#define QuadSPI_WORD5_CMP_MDID_MASK              (0x3FU)
#define QuadSPI_WORD5_CMP_MDID_SHIFT             (0U)
#define QuadSPI_WORD5_CMP_MDID_WIDTH             (6U)
#define QuadSPI_WORD5_CMP_MDID(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD5_CMP_MDID_SHIFT)) & QuadSPI_WORD5_CMP_MDID_MASK)

#define QuadSPI_WORD5_CMP_SA_MASK                (0x40U)
#define QuadSPI_WORD5_CMP_SA_SHIFT               (6U)
#define QuadSPI_WORD5_CMP_SA_WIDTH               (1U)
#define QuadSPI_WORD5_CMP_SA(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD5_CMP_SA_SHIFT)) & QuadSPI_WORD5_CMP_SA_MASK)

#define QuadSPI_WORD5_CMP_PA_MASK                (0x80U)
#define QuadSPI_WORD5_CMP_PA_SHIFT               (7U)
#define QuadSPI_WORD5_CMP_PA_WIDTH               (1U)
#define QuadSPI_WORD5_CMP_PA(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD5_CMP_PA_SHIFT)) & QuadSPI_WORD5_CMP_PA_MASK)

#define QuadSPI_WORD5_CMP_ERR_MASK               (0x20000000U)
#define QuadSPI_WORD5_CMP_ERR_SHIFT              (29U)
#define QuadSPI_WORD5_CMP_ERR_WIDTH              (1U)
#define QuadSPI_WORD5_CMP_ERR(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD5_CMP_ERR_SHIFT)) & QuadSPI_WORD5_CMP_ERR_MASK)

#define QuadSPI_WORD5_CMPVALID_MASK              (0x40000000U)
#define QuadSPI_WORD5_CMPVALID_SHIFT             (30U)
#define QuadSPI_WORD5_CMPVALID_WIDTH             (1U)
#define QuadSPI_WORD5_CMPVALID(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD5_CMPVALID_SHIFT)) & QuadSPI_WORD5_CMPVALID_MASK)
/*! @} */

/*! @name TGMDAD - Target Group n Master Domain Access Descriptor */
/*! @{ */

#define QuadSPI_TGMDAD_MIDMATCH_MASK             (0x3FU)
#define QuadSPI_TGMDAD_MIDMATCH_SHIFT            (0U)
#define QuadSPI_TGMDAD_MIDMATCH_WIDTH            (6U)
#define QuadSPI_TGMDAD_MIDMATCH(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_MIDMATCH_SHIFT)) & QuadSPI_TGMDAD_MIDMATCH_MASK)

#define QuadSPI_TGMDAD_MASK_MASK                 (0xFC0U)
#define QuadSPI_TGMDAD_MASK_SHIFT                (6U)
#define QuadSPI_TGMDAD_MASK_WIDTH                (6U)
#define QuadSPI_TGMDAD_MASK(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_MASK_SHIFT)) & QuadSPI_TGMDAD_MASK_MASK)

#define QuadSPI_TGMDAD_MASKTYPE_MASK             (0x1000U)
#define QuadSPI_TGMDAD_MASKTYPE_SHIFT            (12U)
#define QuadSPI_TGMDAD_MASKTYPE_WIDTH            (1U)
#define QuadSPI_TGMDAD_MASKTYPE(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_MASKTYPE_SHIFT)) & QuadSPI_TGMDAD_MASKTYPE_MASK)

#define QuadSPI_TGMDAD_SA_MASK                   (0xC000U)
#define QuadSPI_TGMDAD_SA_SHIFT                  (14U)
#define QuadSPI_TGMDAD_SA_WIDTH                  (2U)
#define QuadSPI_TGMDAD_SA(x)                     (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_SA_SHIFT)) & QuadSPI_TGMDAD_SA_MASK)

#define QuadSPI_TGMDAD_LCK_MASK                  (0x20000000U)
#define QuadSPI_TGMDAD_LCK_SHIFT                 (29U)
#define QuadSPI_TGMDAD_LCK_WIDTH                 (1U)
#define QuadSPI_TGMDAD_LCK(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_LCK_SHIFT)) & QuadSPI_TGMDAD_LCK_MASK)

#define QuadSPI_TGMDAD_VLD_MASK                  (0x80000000U)
#define QuadSPI_TGMDAD_VLD_SHIFT                 (31U)
#define QuadSPI_TGMDAD_VLD_WIDTH                 (1U)
#define QuadSPI_TGMDAD_VLD(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGMDAD_VLD_SHIFT)) & QuadSPI_TGMDAD_VLD_MASK)
/*! @} */

/*! @name TGSFAR - Target Group n SFAR Address */
/*! @{ */

#define QuadSPI_TGSFAR_SFARADDR_MASK             (0xFFFFFFFFU)
#define QuadSPI_TGSFAR_SFARADDR_SHIFT            (0U)
#define QuadSPI_TGSFAR_SFARADDR_WIDTH            (32U)
#define QuadSPI_TGSFAR_SFARADDR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFAR_SFARADDR_SHIFT)) & QuadSPI_TGSFAR_SFARADDR_MASK)
/*! @} */

/*! @name TGSFARS - Target Group n SFAR Status */
/*! @{ */

#define QuadSPI_TGSFARS_TG_MID_MASK              (0x3FU)
#define QuadSPI_TGSFARS_TG_MID_SHIFT             (0U)
#define QuadSPI_TGSFARS_TG_MID_WIDTH             (6U)
#define QuadSPI_TGSFARS_TG_MID(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_TG_MID_SHIFT)) & QuadSPI_TGSFARS_TG_MID_MASK)

#define QuadSPI_TGSFARS_SA_MASK                  (0x400U)
#define QuadSPI_TGSFARS_SA_SHIFT                 (10U)
#define QuadSPI_TGSFARS_SA_WIDTH                 (1U)
#define QuadSPI_TGSFARS_SA(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_SA_SHIFT)) & QuadSPI_TGSFARS_SA_MASK)

#define QuadSPI_TGSFARS_PA_MASK                  (0x1000U)
#define QuadSPI_TGSFARS_PA_SHIFT                 (12U)
#define QuadSPI_TGSFARS_PA_WIDTH                 (1U)
#define QuadSPI_TGSFARS_PA(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_PA_SHIFT)) & QuadSPI_TGSFARS_PA_MASK)

#define QuadSPI_TGSFARS_CLR_MASK                 (0x20000000U)
#define QuadSPI_TGSFARS_CLR_SHIFT                (29U)
#define QuadSPI_TGSFARS_CLR_WIDTH                (1U)
#define QuadSPI_TGSFARS_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_CLR_SHIFT)) & QuadSPI_TGSFARS_CLR_MASK)

#define QuadSPI_TGSFARS_ERR_MASK                 (0x40000000U)
#define QuadSPI_TGSFARS_ERR_SHIFT                (30U)
#define QuadSPI_TGSFARS_ERR_WIDTH                (1U)
#define QuadSPI_TGSFARS_ERR(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_ERR_SHIFT)) & QuadSPI_TGSFARS_ERR_MASK)

#define QuadSPI_TGSFARS_VLD_MASK                 (0x80000000U)
#define QuadSPI_TGSFARS_VLD_SHIFT                (31U)
#define QuadSPI_TGSFARS_VLD_WIDTH                (1U)
#define QuadSPI_TGSFARS_VLD(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGSFARS_VLD_SHIFT)) & QuadSPI_TGSFARS_VLD_MASK)
/*! @} */

/*! @name TGIPCRS - Target Group n IPCR Status */
/*! @{ */

#define QuadSPI_TGIPCRS_IDATSZ_MASK              (0xFFFFU)
#define QuadSPI_TGIPCRS_IDATSZ_SHIFT             (0U)
#define QuadSPI_TGIPCRS_IDATSZ_WIDTH             (16U)
#define QuadSPI_TGIPCRS_IDATSZ(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_IDATSZ_SHIFT)) & QuadSPI_TGIPCRS_IDATSZ_MASK)

#define QuadSPI_TGIPCRS_SEQID_MASK               (0xF0000U)
#define QuadSPI_TGIPCRS_SEQID_SHIFT              (16U)
#define QuadSPI_TGIPCRS_SEQID_WIDTH              (4U)
#define QuadSPI_TGIPCRS_SEQID(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_SEQID_SHIFT)) & QuadSPI_TGIPCRS_SEQID_MASK)

#define QuadSPI_TGIPCRS_PAR_MASK                 (0x100000U)
#define QuadSPI_TGIPCRS_PAR_SHIFT                (20U)
#define QuadSPI_TGIPCRS_PAR_WIDTH                (1U)
#define QuadSPI_TGIPCRS_PAR(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_PAR_SHIFT)) & QuadSPI_TGIPCRS_PAR_MASK)

